label ch0:
    play sound "/sound/开门.mp3"
    scene 街道
    with fade
    mo "然而，还没等薰跨出家门几步，她的脸色突然变得很差..."
    
    show 薰悲伤头晕
    yuta "“薰...？薰！？你没事吧！？”"
    scene cg3
    with fade
    kaoru "“哥哥，我...我头好晕，腿也用不上力，又是那种...熟悉的感觉......”"
    yuta "“果然，还是会对外面的世界感到害怕么...”"
    scene cg2
    kaoru "“嗯...哥哥……我觉得，我好像有些…”"
    scene cg1
    mo "话音刚落，薰晕倒在了我的怀里..."
    yuta "“等、等等...薰！！”"
    mo "果然...还是我太心急了么。"
    mo "明明知道薰无法出门，结果...我还是自以为是的允许她与我一起上学......"
    "送薰回家 按钮" # 草等会研究怎么加按钮先沾着先
    show 背景21
    with fade
    mo "我抱着薰，焦急的冲回了家中，将薰安置在了她房间的床上。"
    mo "看着薰脸上虚弱的表情，一时半会...我的心里很不是滋味。"
    mo "其实，薰出现这样子的状况，已经不是一次两次了..."
    mo "因为薰的父母很早就离婚了的缘故，导致薰从小学开始就经常被周围的同学嘲笑是【没有爸爸的孩子】。后来，因为受不了来自同学的欺凌，薰被迫休学了。"
    mo "那之后，薰便开始惧怕外面的世界。每当她试图走出家门的时候，便会像是贫血一般的头晕眼花，四肢无力，最终瘫倒在地上..."
    mo "我很清楚，这并不是什么生理上的疾病，而是薰的心理问题。以前的经历给薰带来了太过于深刻的影响，而这种心理上的压力，最终以一种生理上的方式表现了出来而已。"
    show 薰伤心
    kaoru "“那个，哥哥...？”"
    yuta "“薰...！？你、你没事了吧？”"
    mo "薰的声音很快的吸引住了我的注意力，我看向了薰，她用着一种十分内疚的眼神看着我。"
    kaoru "“对不起，都怪我...我又让哥哥失望了......”"
    yuta"“没事的，薰不用勉强自己出门的。”"
    kaoru "“可是…可是哥哥去学校之后，薰一个人在家里好孤单，薰也想跟哥哥一起去学校……”"
    yuta "“这样么...我明白了，放心吧薰，我今天放学一定会早点回来陪你的。”"
    show 薰正常
    kaoru "“真的吗？哥哥...应该不会骗我吧？”"
