label ch3:
    $ quick_menu = False
    $ renpy.pause(1.0)
    scene bg black with fade
    $ renpy.pause(1.0)
    $ renpy.pause(1.0)
    scene 19201080 with fade
    play sound "sound/上课铃.mp3"
    $ renpy.pause(3.0)
    $ quick_menu = True
    mo "一天的课程终于结束，到了放学时间。"
    mo "昏黄的阳光从窗外射了进来，我有些放松的伸了一个懒腰，将手机从口袋里拿了出来。"
    mo "该给谁发信息好呢...？"
    menu:
        "给结衣发短信":
            mo "像往常一样，在放学之后我立马联系了结衣。"
            mo "这种行为倒不是有什么其他的意思，只是平时无论是上学还是放学，和她走在一起已经成为一种习惯了。"
            mo "虽然这样也会遭受到班上不少男生的白眼就是了......"
            $ quick_menu = False
            scene bg black with dissolve
            # $ renpy.pause(1.0)
            $ renpy.movie_cutscene("/video/结衣加载中.webm")
            $ renpy.pause(1.0)
            scene 3 with dissolve
            $ renpy.pause(1.0)
            show yui 眯眼笑 with dissolve
            $ renpy.pause(0.8)
            $ quick_menu = True
            mo "刚走出学校，我便看到身穿校服的结衣正乖巧的站在校门旁边的花坛处等我，看到我朝着她走去，她对着我甜甜的笑了笑。"
            show yui 微笑
            yui "下午好，裕太~"
            yuta "啊...？嗯...下午好，结衣......"
            show yui 悲伤
            yui "怎么了裕太，感觉你好像有什么心事的样子，是发生了什么事吗...？"
            mo "该说不愧是结衣吗，很快就看穿了我内心的想法，不知道是结衣太厉害了还是我太容易被摸透了..."
            yuta "那个，说出来果然还是有些不好意思..."
            yui "诶...？没关系的，裕太有什么烦恼，尽管告诉我好了~"
            yuta "其实，是我上课的时候看漫画不小心被老师给发现了..."
            yuta "然后漫画就被老师给没收了......"
            show yui 苦笑
            yui "啊啊......"
            yuta "对、对不起结衣！我之后会想办法把你的漫画给拿回来的！所以..."
            yui "没事啦，我不会怪裕太的~"
            yuta "诶...？"
            show yui 微笑
            yui "只不过是一本漫画而已，就算真的要不回来的话也没关系的。"
            yuta "可是，那里面有结衣很重要的东西吧，不要回来的话真的没关系么...？"
            yui "很重要的东西？我不记得我有在漫画里放过什么很重要的东西啊...？"
            yuta "可是那本漫画里明明夹着一个粉红色的信封啊，上面还有爱心贴纸呢。难道说...那个信封不是结衣的？"
            show yui 惊讶
            yui "粉红色的信封...爱心贴纸...？啊...！！！"
            scene cg23 with dissolve
            $ renpy.pause(0.3)
            mo "结衣好像是想起来了什么事情一样，表情突然变得慌张了起来，脸也有些红红的..."
            yui "裕、裕太看过了那个信封里的内容了吗...？"
            yuta "并没有看呢，刚发现这个信封的时候漫画就被老师给收走了..."
            yui "呼...那就好那就好......"
            scene 3 with dissolve
            $ renpy.pause(1.0)
            show yui 苦笑 with dissolve
            $ renpy.pause(0.5)
            mo "结衣长叹了一口气，表情也变得放松了不少。"
            yuta "那个信封果然是结衣很重要的东西吧...？"
            show yui 惊讶
            yui "不不不！不是什么重要的东西啦...！这种事情裕太不要太在意啊...！"
            yuta "诶？难道不是情书之类的东西吗？明明用的是粉红色的信封，还特地贴了爱心贴纸来着..."
            show yui 惊讶2
            yui "不、不是啦...！怎么可能是情书啊！"
            mo "可是结衣的脸很红啊..."
            yui "裕太你误会了啦！那、那只是一个普通的信封，里面什么都没写......"
            yuta "可是你刚刚才问过我，有没有看过信封里的内容不是吗？"
            show yui 惊讶
            yui "咕呜..."
            mo "结衣站在原地，半天说不出一句话来，也不知道是为什么，结衣的脸红的就像是快要炸掉了一般..."
            yuta "总、总之！不管怎么样，我会想办法把漫画和信封要回来还给你的，结衣也不要太担心了。"
            show yui 苦笑
            yui "嗯嗯，那就拜托你了..."
            yui "对了，要回来之后也不许擅自打开信封哦！"
            yuta "但是这样说的话反而更想看了啊..."
            show yui 生气
            yui "啊啊啊...！总之就是不许看啦！裕太要是瞒着我偷偷打开了信封的话，我会很生气的哦！"
            yuta "知道啦..."
            scene 街道 with dissolve
            mo "在和结衣进行了一段有些尴尬的对话之后，我便和她一同朝着回家的方向走去。"
            show yui 微笑 with dissolve
            $ renpy.pause(0.5)
            yui "对了裕太，你的妹妹...已经没关系了吗...？"
            yuta "啊...如果不出意外的话，她现在应该还躺在自己的床上呼呼大睡吧。"
            show yui 悲伤
            yui "裕太每天都好辛苦，不仅要上学，还要照顾自己的妹妹，要是我...要是我也能够帮到你些什么就好了......"
            yuta "如果结衣想帮忙的话，不如这个星期来我家吧~"
            show yui 惊讶
            yui "欸！？来、来裕太家里吗...？"
            yuta "嗯，结衣来了之后，薰一定也会很高兴的。毕竟结衣是自带‘万人迷’属性的美少女嘛~"
            yui "这样的话...不如趁此机会，在裕太家一起开个学习会吧。马上就要期末考试了，我也想和裕太一起复习呢。"
            mo "面对结衣的提议，我微笑着点了点头。"
            hide yui 惊讶 with dissolve
            scene 21 with fade
            mo "在和结衣简单的道别之后，我便快步的回到了家中。"
            mo "对于今天的我来说，回到家的第一件事便是打开薰的房门，查看薰的身体状况。"
            scene cg10 with fade
            mo "薰似乎还在休息，并没有过醒来的迹象。我轻叹了一口气，看着薰可爱又香甜的睡脸，我居然一时半会有些心痛..."
            mo "如果...如果薰当年没有经历过那样子的事情，她也应该是一个和其他女孩子一样的活泼快乐的女生吧..."
            mo "只可惜...过去的事无法挽回，我能做的也就只有让薰尽可能的拥有一个更好的未来了......"
            call ch4

        "给石原发短信":
            mo "思前想后，我最终还是决定给石原千夏发了一条短信过去。"
            yuta "放学后先别急着回家，在天台等我，我有事要和你说。"
            mo "短信很快的就发出去了，只不过石原只是简单的回了一句“嗯...”字，便没有了下文。"
            
        "给薰发短信":
            "addddd"